app/controllers/student_app_cat_regnos_controller.rb

SELECT "student_app_cat_regnos".* FROM "student_app_cat_regnos"
---
  def index
    @student_app_cat_regnos = StudentAppCatRegno.all

INSERT INTO "student_app_cat_regnos" ("registrationnumber", "firstname", "lastname", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["registrationnumber", 217204570], ["firstname", "claude"], ["lastname", "clarisse"], ["created_at", "2019-01-31 09:04:50.575549"], ["updated_at", "2019-01-31 09:04:50.575549"]]
---
  def create
    @student_app_cat_regno = StudentAppCatRegno.new(student_app_cat_regno_params)

    respond_to do |format|
      if @student_app_cat_regno.save

SELECT  "student_app_cat_regnos".* FROM "student_app_cat_regnos" WHERE "student_app_cat_regnos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_student_app_cat_regno
      @student_app_cat_regno = StudentAppCatRegno.find(params[:id])